FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_Timer.c
    // Setup the source of the capture
    r->iCTCR = (r->iCTCR & ~(3<<2))|(aSourceIndex<<2);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer_SetMatchRegister
 *---------------------------------------------------------------------------*/
/**
 *  Setup one of several timer's match registers and what do on
 *      a match.
 *
 *  @param [in]    *aWorkspace     Timer's workspace
 *
 *  @param [in]    aMatchRegister  Index to match register (0-3)
 *
 *  @param [in]    aMatchPoint     Number of PWM cycles until match
 *
 *  @param [in]    aDoInterrupt    ETrue if want an interrupt, else EFalse
 *                                 (NOTE: Interrupts currently not implemented)
 *  @param [in]    aDoCounterReset ETrue if counter for this Timer is
 *                                 to be reset on match.
 *  @param [in]    aDoStop         ETrue if counter is to be stopped
 *                                 when match occurs.
 *  @return        T_uezError      UEZ_ERROR_NONE
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError LPC1756_Timer_SetMatchRegister(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        TUInt32 aMatchPoint,
        TBool aDoInterrupt,
        TBool aDoCounterReset,
        TBool aDoStop)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    T_LPC1756_Timer_Registers *r = p->iReg;
    TUInt32 aFlags = 0;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Determine what the combined flags are
    if (aDoInterrupt)
        aFlags |= (1<<0);
    if (aDoCounterReset)
        aFlags |= (1<<1);
    if (aDoStop)
        aFlags |= (1<<2);

    // Set the actions on the match
    r->iMCR &= ~(7<<(aMatchRegister*3));
    r->iMCR |= (aFlags<<(aMatchRegister*3));

    // Change the match register
    (&r->iMR[0])[aMatchRegister] = aMatchPoint;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer_SetExternalControl
 *---------------------------------------------------------------------------*/
/**
 *  Timer is going to have a single edge output (high until matches, then
 *      low, reset counter goes back to high).
 *
 *  @param [in]    *aWorkspace      	Timer's workspace
 *
 *  @param [in]    aMatchRegister   	Point in Fpclk cycles where Timer switches
 *
 *  @return        T_uezError         	UEZ_ERROR_NONE
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError LPC1756_Timer_SetExternalControl(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        T_Timer_ExternalControl aExtControl)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    T_LPC1756_Timer_Registers *r = p->iReg;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Change the external control
    r->iEMR &= ~(3<<(4+aMatchRegister*2));
    r->iEMR |= (aExtControl<<(4+aMatchRegister*2));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer_Reset
 *---------------------------------------------------------------------------*/
/**
 *  Reset the timer's counter.
 *
 *  @param [in]    *aWorkspace	Timer's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_Timer_Reset(void *aWorkspace)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    T_LPC1756_Timer_Registers *r = p->iReg;
    int32_t i;

    // Reset the counter
    r->iTCR |= (1<<1);

    // Small delay to let the timer reset
    for (i=0; i<5; i++)
        {}

    // Release the counter
    r->iTCR &= ~(1<<1);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer_Enable
 *---------------------------------------------------------------------------*/
/**
 *  Enable (run) the timer's counter.
 *
 *  @param [in]    void *aWorkspace   Timer's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_Timer_Enable(void *aWorkspace)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    T_LPC1756_Timer_Registers *r = p->iReg;

    // Enable the counter
    r->iTCR |= (1<<0);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer_Disable
 *---------------------------------------------------------------------------*/
/**
 *  Disable the timer's counter.
 *
 *  @param [in]    void *aWorkspace    	Timer's workspace
 *
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void LPC1756_Timer_Disable(void *aWorkspace)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    T_LPC1756_Timer_Registers *r = p->iReg;

    // Disable the counter
    r->iTCR &= ~(1<<0);
}

/*---------------------------------------------------------------------------*
 * Routine:  IClear
 *---------------------------------------------------------------------------*
 * Description:
 *      Clear all the callback information for this workspace
 * Inputs:
 *      T_LPC247x_Timer_Workspace *p  -- Particular Timer workspace
 *---------------------------------------------------------------------------*/
static void IClear(T_LPC1756_Timer_InterruptCallback aCallbacks[4])
{
    TUInt8 i;
    for (i = 0; i < 4; i++) {
        aCallbacks[i].iCallbackFunc = 0;
        aCallbacks[i].iCallbackWorkspace = 0;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer0_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 Timer0 workspace.
 *
 *  @param [in]    *aWorkspace       	Particular Timer workspace
 *
 *  @return        T_uezError        	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError LPC1756_Timer0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1756_Timer_Registers *)TIM0_BASE;
    p->iInfo = &G_Timer0_Info;
    IClear(p->iCallbacks);

    G_Timer0_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer1_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 Timer1 workspace.
 *
 *  @param [in]    *aWorkspace       	Particular Timer workspace
 *
 *  @return        T_uezError         	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError LPC1756_Timer1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1756_Timer_Registers *)TIM1_BASE;
    p->iInfo = &G_Timer1_Info;
    IClear(p->iCallbacks);

    G_Timer1_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer2_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 Timer1 workspace.
 *
 *  @param [in]    *aWorkspace  	Particular Timer workspace
 *
 *  @return        T_uezError     	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError LPC1756_Timer2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1756_Timer_Registers *)TIM2_BASE;
    p->iInfo = &G_Timer2_Info;
    IClear(p->iCallbacks);

    G_Timer2_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_Timer3_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 Timer1 workspace.
 *
 *  @param [in]    *aWorkspace     	Particular Timer workspace
 *
 *  @return        T_uezError   	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError LPC1756_Timer3_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_Timer_Workspace *p = (T_LPC1756_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1756_Timer_Registers *)TIM3_BASE;
    p->iInfo = &G_Timer3_Info;
    IClear(p->iCallbacks);

